# Класс Vector3D 
# Экземляр класса задается тройкой координат в трехмерном пространстве (x,y,z). 
# Обязательно должны быть реализованы методы:  
# – сложение векторов оператором + (метод add), 
# – вычитание векторов оператором - (метод sub), 
# – скалярное произведение оператором * (метод mul), 
# – умножение на скаляр оператором * (метод mul), 
# – векторное произведение оператором @ (метод matmul). 
# Пример  
# v1 = Vector3D(4, 1, 2) 
# v1.display() 
# v2 = Vector3D() 
# v2.read() 
# v3 = Vector3D(1, 2, 3)

